Tekla Open API Reference for Tekla Structures 2025
AnalysisModelSpectrumProperties.SpectrumZdirection Property
 The Z direction of the spectrum.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double SpectrumZdirection { get; set; }
Public Property SpectrumZdirection As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
AnalysisModelSpectrumProperties Class
Tekla.Structures.Analysis Namespace